Autodesk.Revit.DB.NavisworksExportOptions.SetSelectedElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the element ids of the elements to export. Used only when ExportScope = SelectedElements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.GetSelectedElementIds
Returns the element ids of the elements to export. Empty by default.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.DivideFileIntoLevels
True to divide file into levels, false otherwise.
Default value is true.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ConvertElementProperties
True to convert element properties, false otherwise.
Default value is false.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.FindMissingMaterials
True if the file exporter looks for a match for the materials missing from the export, false otherwise.
Default value is true.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ExportRoomGeometry
True to export Revit room geometry, false otherwise.
Default value is true.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ViewId
The element id of the view to export. InvalidElementId by default. Used only when ExportScope = View.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ExportScope
Options which specifies the export scope of Navisworks Exporter.
Default value is Model.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.Coordinates
Options which specifies the coordinates of Navisworks Exporter.
Default value is Shared.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ExportUrls
True to export URL parameters, false otherwise.
Default value is true.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ExportRoomAsAttribute
True to export data for each room converts into a single shared room attribute, false otherwise.
Default value is true.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ExportLinks
True to export Revit links found in the main model, false to skip links.
Default value is false.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.Parameters
Options which specifies the parameter conversion of Navisworks Exporter.
Default value is All.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ExportElementIds
True to export Revit element ids, false to skip these values.
Default value is true.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ExportParts
True to export Revit part elements, false to export the original parent elements.
Default value is false.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.#ctor
Create an instance of Navisworks Export Options set with default values.
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions
Options which controls the Navisworks export.
Since:
2014